benchmarks/scenarii/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "TSUNG_SHARE_PATH/share/tsung/tsung-1.0.dtd" [] >
<!--
<tsung loglevel="debug" dumptraffic="true" version="1.0">
-->
<tsung>
  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="10000" />
  </clients>
  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="5280" type="tcp" />
  </servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <load duration="10" unit="minute">
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="2" unit="minute">
     <users interarrival="1" unit="second"></users>
   </arrivalphase>
  </load>

  <sessions>
    <session name='passive' probability='85'  type='ts_http'>

      <!-- Authenticate -->
      <request subst="true">
        <dyn_variable name="sid" jsonpath="result.sid" />
        <dyn_variable name="uid" jsonpath="result.uid" />
        <http url='/api/0.5/presence' contents='name=root&amp;auth=password&amp;credential=root' method='POST' />
      </request>

      <!-- Get the roster -->
      <request subst="true">
        <http url='/api/0.5/meeting/all/demo/roster/' contents='uid=%%_uid%%&amp;sid=%%_sid%%' method='POST' />
      </request>

      <!-- First request -->
      <transaction name="total_pending">
        <request subst="true">
          <dyn_variable name="events" jsonpath="result"/>
          <http url='/api/0.5/event/demo/?uid=%%_uid%%&amp;sid=%%_sid%%&amp;start=0' method='GET' />
        </request>
        <setdynvars sourcetype="erlang" callback="tsung_utils:extract_last_timestamp">
          <var name="last" />
        </setdynvars>
        <!-- Main Loop -->
        <for var="pending_counter" from="1" to="0">

          <!-- Wait for events -->
          <transaction name="pending">
            <request subst="true">
              <dyn_variable name="events" jsonpath="result"/>
              <http url='/api/0.5/event/demo/?uid=%%_uid%%&amp;sid=%%_sid%%&amp;start=%%_last%%' method='GET' />
            </request>
          </transaction>

        </for>
      </transaction>
    </session>


    <session name='active' probability='15'  type='ts_http'>

      <!-- Authenticate -->
      <request subst="true">
        <dyn_variable name="sid" jsonpath="result.sid" />
        <dyn_variable name="uid" jsonpath="result.uid" />
        <http url='/api/0.5/presence' version='1.1'  contents='name=root&amp;auth=password&amp;credential=root' method='POST' />
      </request>

      <!-- Get the roster -->
      <request subst="true">
        <http url='/api/0.5/meeting/all/demo/roster' contents='uid=%%_uid%%&amp;sid=%%_sid%%' method='POST' />
      </request>

      <!-- First request -->
      <transaction name="total_pending">
        <request subst="true">
          <dyn_variable name="events" jsonpath="result"/>
          <http url='/api/0.5/event/demo/?uid=%%_uid%%&amp;sid=%%_sid%%&amp;start=0' method='GET' />
        </request>
        <setdynvars sourcetype="erlang" callback="tsung_utils:extract_last_timestamp">
          <var name="last" />
        </setdynvars>

        <!-- Main Loop -->
        <for from="1" to="100" incr="1" var="counter">

          <!-- POST an annotation -->
          <transaction name="post_annotation">
            <request subst="true">
              <http url='/api/0.5/event/demo' contents='type=test&amp;uid=%%_uid%%&amp;sid=%%_sid%%' method='POST' />
            </request>
          </transaction>

          <thinktime random='true' value='2'/>
        </for>

      </transaction>
    </session>
  </sessions>
</tsung>